(function(global, angular, jq){
  'use strict';

  /**
   * ----------------------------------------------------------
   * 인라인 함수를 쓰는 방식과 함수를 밖으로 분리하는 방식이 있다.
   * ----------------------------------------------------------
   * 1. 인라인 함수를 쓰는 방식
   * ---------------------------------------------------------- */

    ///////////////
    // as syntax //
    ///////////////
  angular.module('ngApp').controller('demoCtrl', function() {
    // 비공개 멤버
    var headline = 'this App maked Angular';
    // 공개
    this.headline = headline;
  });



  /**
     * ----------------------------------------------------------
     * 인라인 함수를 쓰는 방식과 함수를 밖으로 분리하는 방식이 있다.
     * ----------------------------------------------------------
     * 2. 함수를 밖으로 분리하는 방식
     * ---------------------------------------------------------- */

})(this, this.angular, this.jQuery);
